; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph1 - mode
	infrared3 - mode
	infrared0 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star1 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared0)
	(supports instrument2 infrared2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(pointing satellite1 Star6)
	(have_image Star7 infrared0)
	(have_image Star8 infrared3)
	(have_image Phenomenon9 thermograph1)
	(have_image Planet10 thermograph1)
	(have_image Planet11 infrared2)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 infrared2)
))

)

; plan
1. (turn_to satellite1 star1 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star1)
   goals met: 0 of 9
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite1 planet10 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet10)
   goals met: 0 of 9
5. (take_image satellite1 planet10 instrument1 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon9 instrument1 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon13 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon13 instrument1 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 3 of 9
10. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 3 of 9
11. (take_image satellite1 planet12 instrument1 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 4 of 9
12. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 4 of 9
13. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 9
14. (turn_to satellite1 star6 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star6)
   goals met: 5 of 9
15. (calibrate satellite1 instrument2 star6)
   added: (calibrated instrument2)
   goals met: 5 of 9
16. (turn_to satellite1 phenomenon14 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon14)
   goals met: 4 of 9
17. (take_image satellite1 phenomenon14 instrument2 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 5 of 9
18. (turn_to satellite1 planet11 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet11)
   goals met: 5 of 9
19. (take_image satellite1 planet11 instrument2 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 6 of 9
20. (turn_to satellite1 star7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star7)
   goals met: 6 of 9
21. (take_image satellite1 star7 instrument2 infrared0)
   added: (have_image star7 infrared0)
   goals met: 7 of 9
22. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 7 of 9
23. (take_image satellite1 star8 instrument2 infrared3)
   added: (have_image star8 infrared3)
   goals met: 8 of 9
24. (turn_to satellite1 star6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star6)
   goals met: 9 of 9
